[{"title":"The Bounty","author":"Steve Hamilton","genre":"Action","progress":"60%","last_opened":"15 Minutes Ago","src":"/image2.jpg","description":"More than two centuries after Master Mate Fletcher Christian led a mutiny against Lieutenant William Bligh on a small, armed transport vessel called Bounty, the true story of this enthralling adventure has become obscured by the legend. Combining vivid characterization and deft storytelling, Caroline Alexander shatters the centuries-old myths surrounding this story. She brilliantly shows how, in a desperate attempt to save one man from the gallows and another from ignominy, two powerful families came together and began to create the version of history we know today. The true story of the mutiny on the Bounty is an epic of duty and heroism, pride and power, and the assassination of a brave honor at the dawn of the Romantic age."},
{"title":"Phoenix Flame","author":"Sara Holland","genre":"Fantasy","progress":"100%","last_opened":"2 Days Ago","src":"/image4.jpg","description":"Maddie thought her problems were over. She saved the Inn at Havenfall—a sanctuary between magical worlds—from the evil Silver Prince. Her uncle the Innkeeper is recovering from a mysterious spell that left him not quite human. And there are still a few weeks of summer left to spend with her more-than-friend Brekken.But there’s more work to be done to protect the Inn—Maddie must put an end to the black-market trading of magical objects and open the Inn’s doors to the once feared land of shapeshifters.As she tries to accomplish both seemingly impossible tasks, Maddie uncovers secrets that could change everything. What if saving everyone means destroying the only home she’s known?This next breathtaking fantasy from the bestselling author of Everless is perfect for fans of Melissa Albert and Holly Black."},
{"title":"Stephan King","author":"Sherry Turkle","genre":"Non Fiction","progress":"100%","last_opened":"5 Days Ago","src":"/image5.jpg","description":"'Long live the King' hailed Entertainment Weekly upon the publication of Stephen King's On Writing. Part memoir, part master class by one of the bestselling authors of all time, this superb volume is a revealing and practical view of the writer's craft, comprising the basic tools of the trade every writer must have. King's advice is grounded in his vivid memories from childhood through his emergence as a writer, from his struggling early career to his widely reported near-fatal accident in 1999 -- and how the inextricable link between writing and living spurred his recovery. Brilliantly structured, friendly and inspiring, On Writing will empower and entertain everyone who reads it -- fans, writers, and anyone who loves a great story well told."},
{"title":"Drama","author":" Raina Telgemeier","genre":"Drama","progress":"30%","last_opened":"Last Week","src":"/image6.jpg","description":"Callie loves theater. And while she would totally try out for her middle school's production of Moon Over Mississippi, she can't really sing. Instead she's the set designer for the drama department stage crew, and this year she's determined to create a set worthy of Broadway on a middle-school budget. But how can she, when she doesn't know much about carpentry, ticket sales are down, and the crew members are having trouble working together? Not to mention the onstage AND offstage drama that occurs once the actors are chosen. And when two cute brothers enter the picture, things get even crazier! "},
{"title":"My Inner Sky","author":"Gard","genre":"Drama","progress":"70%","last_opened":"2 Weeks Ago","src":"/image7.jpg","description":"A whole, beautiful life is only made possible by the wide spectrum of feelings that exist between joy and sorrow. In this insightful and warm book, writer and illustrator Mari Andrew explores all the emotions that make up a life, in the process offering insights about trauma and healing, the meaning of home and the challenges of loneliness, finding love in the most unexpected of places--from birds nesting on a sculpture to a ride on the subway--and a resounding case for why sometimes you have to put yourself in the path of magic.My Inner Sky empowers us to transform everything that's happened to us into something meaningful, reassurance that even in our darkest times, there's light and beauty to be found."},
{"title":"The Code Breaker","author":"Henri","genre":"Thriller","progress":"Dodge","last_opened":"3 Weeks Ago","src":"/image8.jpg","description":"Driven by a passion to understand how nature works and to turn discoveries into inventions, she would help to make what the book’s author, James Watson, told her was the most important biological advance since his co-discovery of the structure of DNA. She and her collaborators turned ​a curiosity ​of nature into an invention that will transform the human race: an easy-to-use tool that can edit DNA. Known as CRISPR, it opened a brave new world of medical miracles and moral questions."},
{"title":"Sweet & Bitter Magic","author":"Taite","genre":"Romance","progress":"100%","last_opened":"Last Month","src":"/image10.jpg","description":"Tamsin is the most powerful witch of her generation. But after committing the worst magical sin, she’s exiled by the ruling Coven and cursed with the inability to love. The only way she can get those feelings back—even for just a little while—is to steal love from others.Wren is a source—a rare kind of person who is made of magic, despite being unable to use it herself. Sources are required to train with the Coven as soon as they discover their abilities, but Wren—the only caretaker to her ailing father—has spent her life hiding her secret."},
{"title":"Rule of Wolves","author":"Dario","genre":"Fiction","progress":"90%","last_opened":"2 Month Ago","src":"/image9.jpg","description":"The Demon King. As Fjerda's massive army prepares to invade, Nikolai Lantsov will summon every bit of his ingenuity and charm—and even the monster within—to win this fight. But a dark threat looms that cannot be defeated by a young king's gift for the impossible."},
{"title":"After","author":"Earlie","genre":"War","progress":"100%","last_opened":"10:58 AM","src":"/image11.jpg","description":"Tessa is a good girl with a sweet, reliable boyfriend back home. She’s got direction, ambition, and a mother who’s intent on keeping her that way.But she’s barely moved into her freshman dorm when she runs into Hardin. With his tousled brown hair, cocky British accent, tattoos, and lip ring, Hardin is cute and different from what she’s used to.But he’s also rude—to the point of cruelty, even. For all his attitude, Tessa should hate Hardin. And she does—until she finds herself alone with him in his room. Something about his dark mood grabs her, and when they kiss it ignites within her a passion she’s never known before. "},
{"title":"Every Last Fear","author":"Danny","genre":"Action","progress":"100%","last_opened":"2:25 AM","src":"/image12.jpg","description":"The tragedy makes headlines everywhere because this isn’t the first time the Pine family has been thrust into the media spotlight. Matt’s older brother, Danny—currently serving a life sentence for the murder of his teenage girlfriend Charlotte—was the subject of a viral true crime documentary suggesting that Danny was wrongfully convicted. Though the country has rallied behind Danny, Matt holds a secret about his brother that he’s never told anyone: the night Charlotte was killed Matt saw something that makes him believe his brother is guilty of the crime.When Matt returns to his small hometown to bury his parents and siblings, he’s faced with a hostile community that was villainized by the documentary, a frenzied media, and memories he’d hoped to leave behind forever. Now, as the deaths in Mexico appear increasingly suspicious and connected to Danny’s case, Matt must unearth the truth behind the crime that sent his brother to prison—putting his own life in peril—and forcing him to confront his every last fear."},
{"title":"Feelings","author":"Neville","genre":"Mystery","progress":"80%","last_opened":"1:58 PM","src":"/image13.jpg","description":"Struggling to let go of negative emotions? Discover a step-by-step process to living a happier, more fulfilling life. Weighed down by negativity? Are painful emotions keeping you from doing the things you love? Author and founder of WhatIsPersonalDevelopment.org Thibaut Meurisse wants to help you take back your life. Through his latest book, you"},
{"title":"Bruised","author":"Russell","genre":"Romance","progress":"50%","last_opened":"1:05 PM","src":"/image14.jpg","description":"Imogen has always believed that her black belt in Tae Kwon Do made her stronger than everyone else--more responsible, more capable. But when she witnesses a holdup in a diner, she freezes. The gunman is shot and killed by the police. And it's all her fault.Now she's got to rebuild her life without the talent that made her special and the beliefs that made her strong. If only she could prove herself in a fight--a real fight--she might be able to let go of the guilt and shock. She's drawn to Ricky, another witness to the holdup, both romantically and because she believes he might be able to give her the fight she’s been waiting for.But when it comes down to it, a fight won’t answer Imogen's big questions: What does it really mean to be stronger than other people? Is there such a thing as a fair fight? And can someone who's beaten and bruised fall in love?"},
{"title":"The Anubis Gates","author":"Willem","genre":"Comedy","progress":"100%","last_opened":"4:17 AM","src":"/image15.jpg","description":"Brendan Doyle, a specialist in the work of the early-nineteenth century poet William Ashbless, reluctantly accepts an invitation from a millionaire to act as a guide to time-travelling tourists. But while attending a lecture given by Samuel Taylor Coleridge in 1810, he becomes marooned in Regency London, where dark and dangerous forces know about the gates in time.Caught up in the intrigue between rival bands of beggars, pursued by Egyptian sorcerers, and befriended by Coleridge, Doyle somehow survives and learns more about the mysterious Ashbless than he could ever have imagined possible."},
{"title":"Lost in the Never Woods","author":"Edgar","genre":"Animation","progress":"100%","last_opened":"8:41 AM","src":"/image16.jpg","description":"It's been five years since Wendy and her two brothers went missing in the woods, but when the town’s children start to disappear, the questions surrounding her brothers’ mysterious circumstances are brought back into light. Attempting to flee her past, Wendy almost runs over an unconscious boy lying in the middle of the road, and gets pulled into the mystery haunting the town.Peter, a boy she thought lived only in her stories, claims that if they don't do something, the missing children will meet the same fate as her brothers. In order to find them and rescue the missing kids, Wendy must confront what's waiting for her in the woods."},
{"title":"How Beautiful We Were","author":"Esdras","genre":"Drama","progress":"63%","last_opened":"9:11 AM","src":"/image17.jpg","description":"So begins Imbolo Mbue’s powerful second novel, How Beautiful We Were. Set in the fictional African village of Kosawa, it tells the story of a people living in fear amidst environmental degradation wrought by an American oil company.Pipeline spills have rendered farmlands infertile. Children are dying from drinking toxic water. Promises of clean-up and financial reparations to the villagers are made—and ignored. The country’s government, led by a brazen dictator, exists to serve its own interest. Left with few choices, the people of Kosawa decide to fight back. Their struggle would last for decades and come at a steep price."},
{"title":"The Committed","author":"Hurley","genre":"Comedy","progress":"75%","last_opened":"8:27 PM","src":"/image18.jpg","description":"The long-awaited new novel from one of America’s most highly regarded contemporary writers, The Committed follows the Sympathizer as he arrives in Paris as a refugee. There he and his blood brother Bon try to escape their pasts and prepare for their futures by turning their hands to capitalism in one of its purest forms: drug dealing. No longer in physical danger, but still inwardly tortured by his reeducation at the hands of his former best friend, and struggling to assimilate into a dominant culture, the Sympathizer is both charmed and disturbed by Paris. As he falls in with a group of left-wing intellectuals and politicians who frequent dinner parties given by his French Vietnamese “aunt,” he finds not just stimulation for his mind but also customers for his merchandise―but the new life he is making has dangers he has not foreseen, from the oppression of the state, to the self-torture of addiction, to the seemingly unresolvable paradox of how he can reunite his two closest friends, men whose worldviews put them in absolute opposition.Both literary thriller and brilliant novel of ideas, The Committed is a blistering portrayal of commitment and betrayal that will cement Viet Thanh Nguyen’s position in the firmament of American letters"},
{"title":"The Art of Falling For You","author":"Cointon","genre":"Documentary","progress":"94%","last_opened":"11:33 PM","src":"/image19.jpg","description":"Bay Bishop aka The New Girl is my new neighbor. In her glasses and stage crew black clothes she has a knack for fading into the background.She’s probably the only one who rolls her eyes when I walk past instead of cheering on my last touchdown play. But before I can shove her into the recesses of my mind filed under “Not my problem” she lands herself smack dab in the middle of my dreams.I catch her singing with a voice unlike any I’ve heard before that taps into feelings I shouldn’t have for the girl who avoids me at all costs."},
{"title":"The Lost Apothecary","author":"Antoine","genre":"Action","progress":"100%","last_opened":"11:15 PM","src":"/image20.jpg","description":"Bay Bishop aka The New Girl is my new neighbor. In her glasses and stage crew black clothes she has a knack for fading into the background.She’s probably the only one who rolls her eyes when I walk past instead of cheering on my last touchdown play. But before I can shove her into the recesses of my mind filed under “Not my problem” she lands herself smack dab in the middle of my dreams.I catch her singing with a voice unlike any I’ve heard before that taps into feelings I shouldn’t have for the girl who avoids me at all costs."},
{"title":"The Ladies of the Secret Circus","author":"Ware","genre":"Drama","100%":"Pontiac","last_opened":"8:26 PM","src":"/image21.jpg","description":"Paris, 1925: To enter the Secret Circus is to enter a world of wonder-a world where women tame magnificent beasts, carousels take you back in time, and trapeze artists float across the sky. But each daring feat has a cost. Bound to her family's strange and magical circus, it's the only world Cecile Cabot knows-until she meets a charismatic young painter and embarks on a passionate love affair that could cost her everything.Virginia, 2005: Lara Barnes is on top of the world-until her fiancé disappears on their wedding day. Desperate, her search for answers unexpectedly leads to her great-grandmother's journals and sweeps her into the story of a dark circus and a generational curse that has been claiming payment from the women in her family for generations."},
{"title":"The Lamplighters","author":"Byram","genre":"Sci-Fi","progress":"100%","last_opened":"6:06 AM","src":"/image22.jpg","description":"Cornwall, 1972. Three keepers vanish from a remote lighthouse, miles from the shore. The entrance door is locked from the inside. The clocks have stopped. The Principal Keeper’s weather log describes a mighty storm, but the skies have been clear all week.The Lamplighters is a heart-stopping mystery rich with the salty air of the Cornish coast, and an unforgettable story of love and grief that explores the way our fears blur the line between the real and the imagined. "}]






